Q1: What is **Mean**?

**Mean** also known as average is the **sum** of all **total** numbers divided by total number of items.

Q2: What is **Median**?

**Median** is known as the middle value of dataset.

Q3: How **mean** and **median** is used in data science?

There are 2 methods:

1.**Descriptive Analysis** (Opening a car show room).

2.**Data Cleaning** (Filling NA Values) (Loan approval model)

Q4: What is **Mode**?

The **maximum count** of item will be the mode.

For example You are going to a restaurant and you need to do survey like what to eat. 

Mode is nothing but a **most frequently** occuring value in dataset.

Q5: What is **percentile**?

While the term “percentile” lacks a universal definition, the most widely accepted definition of a percentile is a value that has a certain percentage of scores below it [1]. For example, let’s say the 70th percentile on an exam was 156. That means if you scored 156 on the exam, your score was better than 70 percent of test takers.

The 25th percentile is also called the first quartile.
The 50th percentile is generally the median (if you’re using the third definition—see below).
The 75th percentile is also called the third quartile.
The difference between the third and first quartiles is the interquartile range.

Q5: What is **outlier**?

**Outlier** is a datapoint that is vert different than the rest of the data points.

Q6: How is **percentile** used in Data Science?

It is used in 2 ways:

1. **Outlier Removal** (Income Dataset)

2. **General Data Analysis** (SAT/GRE/IELTS scores)

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('01_income.csv',names=['name','income'], skiprows=[0])
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [3]:
df.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [6]:
df.income.quantile(0.75) # it give the same value as 75% percentile in describe function

np.float64(7750.0)

In [7]:
df.income.quantile(0.25)

np.float64(5500.0)

In [8]:
df.income.quantile(0.50)

np.float64(7000.0)

In [9]:
df.income.quantile(1) # max value

np.float64(10000000.0)

In [10]:
df.income.quantile(0) # Min value

np.float64(4000.0)

In [11]:
# we can give any number like
df.income.quantile(0.45)

# 0.45 is under 0.50 which was 7000 so based on statistical value 0.45= 6700

np.float64(6700.0)

What is a **Quantile**?

The word **“quantile”** comes from the word **quantity.** In simple terms, a **quantile** is where a sample is divided into **equal-sized**, **adjacent**, **subgroups** (that’s why it’s sometimes called a **“fractile“**). It can also refer to **dividing a probability distribution** into areas of **equal probability**.

The **median** is a **quantile**; the median is placed in a probability distribution so that exactly half of the data is lower than the median and half of the data is above the median. The median cuts a distribution into two equal areas and so it is sometimes called 2-quantile.

It can also give leaner, lower and higher values like the example we have in the lecture where 25% percentile is either on lower side or higher side or either it is in between which is linear.

So we have already find linear in the previous codes but let us find lower and higher

In [12]:
df.income.quantile(0.25)

np.float64(5500.0)

In [13]:
df.income.quantile(0.25,interpolation='lower')

np.int64(5000)

In [14]:
df.income.quantile(0.25,interpolation='higher')

np.int64(6000)

In [16]:
# We can use quantile to remove the outlier which is the most different value in dataset.
percentile_99 = df.income.quantile(0.99)
percentile_99

np.float64(9400479.999999994)

In [18]:
df[df.income>percentile_99] # the outlier value

        name    income
6  Elon Musk  10000000

In [20]:
# to remove it
df_no_outlier = df[df.income<=percentile_99]
df_no_outlier # the outlier has been removed i-e Elon Musk value in dataset

    name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

data scientist used these steps alot for data cleaning 
# It was all about the 1st use case

Now lets look at 2nd use case
# Filling NA Values

In [23]:
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [26]:
# lets make Sofia(3) value null
df['income'][3]=np.nan

C:\Users\hassa\AppData\Local\Temp\ipykernel_7184\394383017.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['income'][3]=np.nan
C:\Users\hassa\AppData\Local\Temp\ipykernel_7184\394383017.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['income'][3]=np.nan

In [27]:
df # the value at index 3 has been converted to null value

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [28]:
# in real life we have to with alot of Null values

In [30]:
# lets assume we have to fill it so we do find mean of the income
df.income.mean()

np.float64(1671666.6666666667)

In [31]:
df_new = df.fillna(df.income.mean())
df_new

        name        income
0        Rob  5.000000e+03
1      Rafiq  6.000000e+03
2       Nina  4.000000e+03
3      Sofia  1.671667e+06
4      Mohan  8.000000e+03
5        Tao  7.000000e+03
6  Elon Musk  1.000000e+07

It is a disaster because at an average we have values in thousands but we have one outlier value which is 10million and due to this outlier the mean got affected and index[3]=sofia got such a high value of 1.6 million which is not good.

so in this case we should use classic median instead of mean.

In [32]:
df_new = df.fillna(df.income.median())
df_new

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0